{
    "materias":[
        {
            "id":1,
            "nome":"Sequencia dos Números racionais",
            "introducao":["A sequencia de números que usamos no dia a dia, 0, 1, 2, 3, 4, 5, ..., ela faz parte do que chamamos de conjunto dos Números Naturais. Essa sequencia é infinita, pois todo numero tem um sucessor. "],
            "subtopicos":[
                {
                    "titulo":"",
                    "conteudo":[
                        "Sucessor é sempre o que esta depois de uma sequencia, por exemplo, o numero 6 é sucessor do número 5, e assim em diante. Seguindo essa logica temos também os antecessores.",
                        "Antecessores são os temos que vem antes, por exemplo, o número 9 é antecessor do número 10, assim podemos formar uma sequencia de números consecutivos dentro do conjunto dos números naturais, 7, 8, 9 e 10 são números consecutivos, 27, 28, 29 também é uma sequencia de consecutivos."
                    ]
                    
                },
                {
                    "titulo":"Régua numérica",
                    "imagem": {
                            "src": "/img/regua_numerica.png",
                            "width" : 700,
                            "alt": "Régua numérica de 1 a 16"
                        }, 
                    "conteudo":[
                        "Podemos colocar uma serie de números em uma reta para que possamos analisar qual numero é maior que o outro.",
                        "Os números que estão a direita são maiores que o da esquerda, EX:","5>3 (lemos, cinco é maior que três);"," 2<6 (dois é menor que seis);"," 7 = 7 (sete é igual a sete )"
                    ]
                }
            ]
        },
        {
            "id":2,
            "nome": "Frações e Números Decimais",
            "introducao":["As frações são usadas para representar partes de um todo. Elas também podem indicar divisões entre números. Por exemplo, dividir 2 barras de chocolate entre 5 crianças resulta em {fracao:2/5} de barra para cada uma. Isso mostra que o traço da fração também pode representar uma divisão."],
            "subtopicos":[
                {
                    "titulo":"Frações e números decimais",
                    "conteudo":[
                        "Toda fração pode ser escrita na forma decimal, realizando a divisão entre o numerador e o denominador:",
                        "{fracao:1/4} = 0,25;", "{fracao:3/2} = 1,5;", "{fracao:5/9} = 0,555.. (é uma disima periodica)"
                    ]
                },
                {
                    "titulo":"Frações equivalentes",
                    "conteudo":[
                        "Duas frações são equivalentes quando representamos a mesma quantidade como {fracao:1/2} = {fracao:2/4}. Para obter frações equivalentes, basta multiplicar ou dividir o numerador e o denominador  pelo mesmo numero, diferente de zero.",
                        "Essas equivalências também ajudam a conventer frações em números decimais de forma mais fácil."
                    ]
                },
                {
                    "titulo":"Frações na reta numerica ",
                    "conteudo":[
                        "Na reta numerica, tanto as frações quanto os números decimais podem ser localizados. Por exemplo, {fracao:1/2}= 0,5, está localizado entre o 0 e 1.",
                        "Qunato mais dividimos a unidade (em decimos, centecimos, milesimos, etc), mais precisas ficam as representações. "
                    ]
                }
            ]
        },
        {
            "id": 3,
            "nome": "Números Inteiros",
            "introducao":["Os números inteiros incluem todos os números positivos, negativos e o zero. Eles são usados para representar situações do dia a dia em que há ganhos, perdas, subidas ou descidas.","Exemplos:","Temperaturas abaixo de zero (–5 °C)","Andares de um prédio (–2 é o segundo subsolo)","Saldo bancário (–100 reais indica dívida)",
        "Na reta numérica, os números negativos ficam à esquerda do zero e os positivos à direita. Quanto mais à direita, maior é o número."],
            "subtopicos":[
                {
                    "titulo":"Sinais",
                    "conteudo":[
                        "O sinal + significa que um numero é positivo, como o lucro de uma impresa, já o simbolo - representa que o numero é negativo, perda ou prejuízo",
                        "As regras para lidar quando se encontra os dois são as seguintes:","+ com + = + (positivo) ;", "- com - = + (positivo)", "+ com - = - (negativo)", "- com + = - (negativo)"
                    ]
                },
                {
                    "titulo":"Adição e Subtração de Números Inteiros",
                    "conteudo":[
                        "Mesmos sinais: soma os números e mantém o sinal. Exemplo: (–3) + (–5) = –8", "Sinais diferentes: subtrai o menor do maior e usa o sinal do número com maior valor absoluto. Exemplo 1: (+8) + (–5) = +3; Exemplo 2: (–9) + (+4) = –5",
                        "Essas operações também se aplicam a situações reais, como variações de temperatura ou mudanças em saldos e pontuações."
                    ]
                },
                {
                    "titulo":"Valor Absoluto",
                    "conteudo":[
                        "O valor absoluto (ou módulo) de um número indica sua distância até o zero. ","Exemplo: | –7| = 7."
                    ]
                }
            ]
        }
    ]
}